Revit 2026 API

# PipeFittingAndAccessoryData Methods

---

The PipeFittingAndAccessoryData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
|  | GetEntity | Returns an Entity of the Schema of the serverGUID. |
|  | GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace